verification/runs/F3_runs/wedge/M2.5_th10/fine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2.5 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (2.5 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            zeroGradient;
    }
    obstacle
    {
        type            slip;
        
    }
    defaultFaces
    {
        type            empty;
    }
}
