verification/runs/F3_runs/wedge/M2.5_th10/fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.300000 0.000000 -0.005000)
    (0.000000 0.000000 -0.005000)
    (1.000000 0.176327 -0.005000)
    (-0.300000 0.993999 -0.005000)
    (0.000000 0.993999 -0.005000)
    (1.000000 0.993999 -0.005000)
    (-0.300000 0.000000 0.005000)
    (0.000000 0.000000 0.005000)
    (1.000000 0.176327 0.005000)
    (-0.300000 0.993999 0.005000)
    (0.000000 0.993999 0.005000)
    (1.000000 0.993999 0.005000)
);

blocks
(
    hex (0 1 4 3 6 7 10 9) (120 80 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) (240 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 6 9 3));
    }
    outlet
    {
        type patch;
        faces ((2 5 11 8));
    }
    bottom
    {
        type symmetryPlane;
        faces ((0 1 7 6));
    }
    top
    {
        type patch;
        faces ((3 9 10 4)(4 10 11 5));
    }
    obstacle
    {
        type wall;
        faces ((1 2 8 7));
    }
    defaultFaces
    {
        type empty;
        faces ();
    }
);

mergePatchPairs
(
);
