verification/runs/F3_runs/wedge/M2.5_th10/fine/system/surfaceSampleDict
FoamFile { version 2.0; format ascii; class dictionary; object surfaceSampleDict; }
type surfaces;
libs (sampling);
interpolationScheme cellPoint;
surfaceFormat raw;
fields (p rho T);
surfaces
(
    wedgeSurface
    {
        type patch;
        patches (obstacle);
        interpolate false;
        triangulate false;
    }
);
